{"backend": "tensorflow", "keras_version": "2.0.3", "config": {"output_layers": [["add_1", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 1, 41, 41], "name": "input_1", "sparse": false}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "name": "conv2d_1", "filters": 8, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_size": [5, 5], "kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "name": "conv2d_2", "filters": 8, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_size": [9, 9], "kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "name": "conv2d_3", "filters": 8, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_1", 0, 0, {}], ["conv2d_2", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": 1}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "name": "conv2d_4", "filters": 16, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "name": "conv2d_5", "filters": 16, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "name": "conv2d_6", "filters": 16, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "name": "conv2d_7", "filters": 8, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"kernel_size": [5, 5], "kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "name": "conv2d_8", "filters": 8, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"kernel_size": [9, 9], "kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "name": "conv2d_9", "filters": 8, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}}, {"name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["conv2d_8", 0, 0, {}], ["conv2d_9", 0, 0, {}]]], "config": {"name": "concatenate_2", "trainable": true, "axis": 1}}, {"name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "name": "conv2d_10", "filters": 1, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu"}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["input_1", 0, 0, {}], ["conv2d_10", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}